tinko26/ao/src/ao_sys_xc32_pic32mz_dak/ao_ir_gpu.h
// ----------------------------------------------------------------------------

// MIT License

// Copyright (c) 2022 Stefan Wagner

// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
// FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
// DEALINGS IN THE SOFTWARE.

// ----------------------------------------------------------------------------

// GPU interrupt.

// ----------------------------------------------------------------------------

#include <stdbool.h>
#include <sys/attribs.h>
#include <xc.h>

// ----------------------------------------------------------------------------

#ifndef AO_IR_GPU_ATTRIBUTE

#define AO_IR_GPU_ATTRIBUTE     __ISR(_GPU_VECTOR, IPL4SRS)

#endif

#ifndef AO_IR_GPU_PRIO

#define AO_IR_GPU_PRIO          (4)

#endif

#ifndef AO_IR_GPU_SUBPRIO

#define AO_IR_GPU_SUBPRIO       (0)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_gpu_disable

#define ao_ir_gpu_disable()     { IEC6CLR = _IEC6_GPUIE_MASK; }

#endif

#ifndef ao_ir_gpu_enable

#define ao_ir_gpu_enable()      { IEC6SET = _IEC6_GPUIE_MASK; }

#endif

#ifndef ao_ir_gpu_is_enabled

#define ao_ir_gpu_is_enabled()  ((IEC6 & _IEC6_GPUIE_MASK) ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_ir_gpu_is_pending

#define ao_ir_gpu_is_pending()  ((IFS6 & _IFS6_GPUIF_MASK) ? true : false)

#endif

#ifndef ao_ir_gpu_reply

#define ao_ir_gpu_reply()       { IFS6CLR = _IFS6_GPUIF_MASK; }

#endif

#ifndef ao_ir_gpu_request

#define ao_ir_gpu_request()     { IFS6SET = _IFS6_GPUIF_MASK; }

#endif

// ----------------------------------------------------------------------------
